## [foo/dolor/prod](https://omicron7.app.spacelift.io/stack/foo-dolor-prod/run/01HRWQT2PZCD9CZMM32ZZBZB9K) plan logs

<details>
<summary>Click here to expand</summary>

```
[01HRWE682B5KBNPFJTN0B4EBVP] Planning changes with 0 custom hooks...
data.spacelift_stack.ansible: Reading...
tls_private_key.private_key: Refreshing state... [id=d1e44b0ae48586fdfdeab943b54e149ec112746a]
data.spacelift_stack.ansible: Read complete after 0s [id=spacelift-ansible]
data.aws_ami.ubuntu: Reading...
data.aws_vpc.main: Reading...
aws_key_pair.ssh_key: Refreshing state... [id=spacelift-test-prod]
data.aws_ami.ubuntu: Read complete after 0s [id=ami-080e1f13689e07408]
data.aws_vpc.main: Read complete after 1s [id=vpc-dc2d9fb9]
data.aws_security_group.egress_any_public: Reading...
data.aws_security_group.ingress_ssh_public: Reading...
data.aws_subnet.prod_apps_1a: Reading...
data.aws_subnet.prod_apps_1a: Read complete after 0s [id=subnet-f2c2dfda]
data.aws_security_group.ingress_ssh_public: Read complete after 0s [id=sg-096a4f902ad7e1d92]
data.aws_security_group.egress_any_public: Read complete after 0s [id=sg-0c9ef2a8aa4869890]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.instances[0] will be created
  + resource "aws_instance" "instances" {
      + ami                                  = "ami-080e1f13689e07408"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "spacelift-test-prod"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-f2c2dfda"
      + tags                                 = {
          + "Name" = "spacelift-test-0"
        }
      + tags_all                             = {
          + "Name"       = "spacelift-test-0"
          + "managed_by" = "terraform"
          + "owner"      = "devops-engineering-team@cru.org"
          + "terraform"  = "/mnt/workspace/source/foo/dolor/prod"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-096a4f902ad7e1d92",
          + "sg-0c9ef2a8aa4869890",
        ]
    }

  # spacelift_mounted_file.private_key will be created
  + resource "spacelift_mounted_file" "private_key" {
      + checksum      = (known after apply)
      + content       = (sensitive value)
      + id            = (known after apply)
      + relative_path = "id_rsa"
      + stack_id      = "spacelift-ansible"
      + write_only    = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_instances = [
      + (known after apply),
    ]
[01HRWE682B5KBNPFJTN0B4EBVP] Changes are GO
[01HRWE682B5KBNPFJTN0B4EBVP] Uploading the list of managed resources...
[01HRWE682B5KBNPFJTN0B4EBVP] Please be aware that the run changes calculation includes output changes.
[01HRWE682B5KBNPFJTN0B4EBVP] Resource list upload is GO
[01HRWE682B5KBNPFJTN0B4EBVP] Generating JSON representation of the plan...
[01HRWE682B5KBNPFJTN0B4EBVP] JSON representation is GO
[01HRWE682B5KBNPFJTN0B4EBVP] Loading custom plan policy inputs...
[01HRWE682B5KBNPFJTN0B4EBVP] 0 custom plan policy inputs found
[01HRWE682B5KBNPFJTN0B4EBVP] No plan policies to evaluate
```

</details>